app/Controllers/Biodata.php

SELECT COUNT(*) AS `numrows` FROM `biodata`
---
    public function index()
    {
        $data['title'] = 'Biodata';

        // Ambil data biodata dan hitung jumlahnya
        $data['biodataCount'] = $this->biodataModel->countAll(); // Hitung jumlah biodata