app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `biodata`
SELECT COUNT(*) AS `numrows` FROM `survei`
---
    public function index()
    {
        $data['title'] = 'Dashboard';
        // Get counts for biodata and surveys
        $data['biodatacount'] = $this->biodataModel->countAll(); // Replace with actual method
        $data['survei'] = $this->surveiModel->countAll(); // Replace with actual method