app/Controllers/Survei.php

    public function index()
    {
        $session = session();

        // Pengecekan peran pengguna
        if (!in_array($session->get('role'), ['Admin', 'Supervisor', 'Penginput', 'Administrasi'])) {
            return redirect()->to('/unauthorized')->with('error', 'Anda tidak memiliki akses untuk halaman tersebut.');
        }

        $data = [
            'title' => 'Survei',
            'survei' => $this->surveiModel->findAll() // Mengambil data survei dari model
---
SELECT *
FROM `survei`

    public function hapus($sobat_id)
    {
        $this->surveiModel->delete($sobat_id);
---
DELETE FROM `survei`
WHERE `sobat_id` IN ('12')