app/Models/BiodataModel.php

SELECT *
FROM `biodata`
---
    public function getBiodata()
    {
        return $this->findAll(); // Mengambil semua data dari tabel