app/Models/SurveiModel.php

    public function filterdatabulan($bulan = null)
{
    $builder = $this->db->table('survei'); // Menggunakan tabel survei

    if ($bulan) {
        // Filter catatan berdasarkan kolom 'bulan'
        $builder->where('bulan', $bulan);
    }

    return $builder->get()->getResultArray(); // Eksekusi kueri dan kembalikan hasil sebagai array asosiatif
---
SELECT *
FROM `survei`
WHERE `bulan` = 'Juni'